= Key Terminology
:order: 1

As we covered in the link:/courses/cypher-fundamentals/[Cypher Fundamentals^] course, we query Neo4j using a language called Cypher.
In order to send Cypher queries from our application we use an object called a *Driver*.


Throughout this course we will use five key pieces of terminology:

* *Driver* - The top level object for all Neo4j interaction
* *Session* - The logical context for sequence of transactions
* *Transaction* - An isolated unit of work executed against the database - for example a read or write query.
* *Query* - A Cypher query executed on the the Neo4j server, along with _parameters_.
* *Result* - An object that provides access to a stream of records returned by the Cypher statement.

Let's take a look at these terms in some more detail.

== Driver


> The **Driver** object is a thread-safe, application-wide fixture from which all Neo4j interaction derives.
>
> The Driver API is **topology independent**, so you can run the same code against a *cluster* or a *single instance*.


You will create a single instance of the Driver in your application that you will share across your modules.
The Neo4j JavaScript Driver is officially supported and connects to a Neo4j instance using the Bolt protocol.

// [TIP]
// Bolt is a binary network protocol built by the team behind Neo4j.



== Session

> A **Session** is a short-lived, *thread-unsafe* logical context for a sequence of related transactional units of work.

From the driver, you will create sessions.

A session is a container for a sequence of transactions. Sessions borrow connections from a pool as required and so should be considered lightweight and disposable.

It is important to remember that sessions are not the same as database connections.  Sessions provide a client-side abstraction for grouping units of work and can take advantage of one or more connections.

Connections are managed internally by the driver within a session and are not directly exposed to the user.


== Transaction

Inside a session, you will execute one or more Transactions.

Transactions are atomic units of work consisting of one or more Cypher statement. Transactions allow you to complete an entire unit of work, committing once all statements have succeeded, or performing roll back should anything go wrong, leaving the database in its original state.



=== Query

Within a transaction, one or more statements can be sent to the database, each consisting of a single string and an optional set of parameters.  The server will evaluate and execute the query before responding with a stream of results.

An example cypher statement may include placeholders for parameters starting with a dollar sign (`$`).

.Example Query
[source,cypher,role=noplay]
MATCH (p:Person {name: $name})
RETURN p

Parameters are provided as an object where the key relates to the value prefixed with a dollar sign.

.Parameter Object
[source]
{
  name: "Tom Hanks"
}

Using parameters is recommended because it avoids the risk of malicious code being _injected_ into the query.


=== Result

After executing a query, Neo4j will return a stream of **Records** along with a set of additional meta data.

A record is an unordered, keyed set of values specified in the `RETURN` statement.

The meta data included in the Result include statistics on how many nodes and relationships were created, updated or deleted as a result of the query.


== Check Your Understanding

* TODO

