= Text to Cypher retriever
:type: lesson
:order: 3
:branch: main

[.slide.discrete]
== Overview

The `Text2CypherRetriever` retriever allows you to create `GraphRAG` pipelines that can answer natural language questions by generating and executing Cypher queries against the knowledge graph.

Using text to cypher retrieval can help you get precise information from the knowledge graph based on user questions. For example, how many lessons are in a course, what concepts are covered in a module, or how technologies relate to each other.

In this lesson, you will create a text to Cypher retriever and use it to answer questions about the data in knowledge graph.

[.slide]
== Create a Text2CypherRetriever GraphRAG pipeline

Your task is to:

. Open `workshop-genai/text2cypher_rag.py`.
. Review the code and how the `Text2CypherRetriever` works.
. Run the code and explore how it generates Cypher queries
. Experiment with different questions and observe the context and responses.

[.slide-only]
====
**Continue with the lesson to create the text to Cypher retriever.**
====

[.transcript-only]
=== Text to Cypher Retriever

Open `workshop-genai/text2cypher_rag.py` and review the code.

[source, python]
----
include::{repository-raw}/{branch}/workshop-genai/text2cypher_rag.py[]
----

The retriever is configured to use your database connection and given an example of how to query nodes by name:

[source, python]
----
include::{repository-raw}/{branch}/workshop-genai/solutions/text2cypher_rag.py[tag=examples]

include::{repository-raw}/{branch}/workshop-genai/solutions/text2cypher_rag.py[tag=retriever]
----

The response includes the Cypher statement that the LLM generated and the results from executing the query:

[source, python]
----
include::{repository-raw}/{branch}/workshop-genai/solutions/text2cypher_rag.py[tag=print_response]
----

Running the code for the query, _"How many technologies are mentioned in the knowledge graph?"_, will produce a response similar to:

_114 technologies are mentioned in the knowledge graph._

The context shows that the LLM generated and executed the following Cypher query:

[source, cypher]
----
MATCH (t:Technology) RETURN count(t) AS technologyCount
----

The following data was returned from the knowledge graph and passed as context to the LLM:

[source, python]
----
[RetrieverResultItem(content='<Record technologyCount=114>', metadata=None)]
----

[.slide]
== Experiment with Different Questions

The `Text2CypherRetriever` passed the graph schema to the LLM to help it generate accurate Cypher queries.

Try asking different questions about the knowledge graph such as:

* [copy]#How does Neo4j relate to other technologies?#
* [copy]#What entities exist in the knowledge graph?#
* [copy]#What resource urls are referenced?#

Review the responses, the generated Cypher queries, and the results passed to the LLM.

read::Continue[]

[.summary]
== Lesson Summary

In this lesson, you:

* Created a `GraphRAG` pipeline using the `Text2CypherRetriever`.
* Used natural language questions to generate and execute Cypher queries against the knowledge graph.

In the next module you will explore how to customize the `SimpleKGPipeline` to create knowledge graphs for different types of data, scenarios, and use cases.
